[
  {
    "id": "reserve_ammo_crate",
    "name": "Ammo Crate",
    "type": "Tactical",
    "label": "Resource",
    "description": "Once, while resting, spend this reserve to restore 1 charge for your entire party’s LIMITED systems and weapons."
  },
  {
    "id": "reserve_shielding",
    "name": "Shielding",
    "type": "Mech",
    "label": "Resource",
    "description": "Get a mech tune-up from the folks at the Governor’s Farm. Spend this reserve to start the next combat only with OVERSHIELD 5."
  },
  {
    "id": "reserve_weathering",
    "name": "Weathering",
    "type": "Mech",
    "label": "Resource",
    "description": "Spend this reserve to grant your mech IMMUNITY to difficult terrain and SLOWED for the next mission."
  },
  {
    "id": "reserves_scouting_encounter",
    "name": "Scouting (Encounter)",
    "type": "Tactical",
    "label": "Resource",
    "description": "Spend this reserve to look at one encounter and learn all information about the NPCs and sitrep involved before it starts. You must spend this at the start of combat."
  },
  {
    "id": "reserve_high_caliber_ammo",
    "name": "High Caliber Ammo",
    "type": "Tactical",
    "label": "Resource",
    "description": "Spend this reserve at the start of any combat scene to give all your weapons AP until the end of the scene."
  },
  {
    "id": "reserve_stash_of_private_moonshine",
    "name": "Stash Of Private Moonshine",
    "type": "Resource",
    "label": "Resource",
    "description": "Trade with someone in the colony for favors owed. Gain +1 ACCURACY on all non-combat skill checks as long as that person can help you. This effect ends at the end of the following downtime."
  },
  {
    "id": "reserve_colony_drop",
    "name": "Colony Drop",
    "type": "Tactical",
    "label": "Resource",
    "description": "Spend this reserve to have you and your allies drop from a Landmark cargo drop ship, allowing you all to deploy anywhere on the map in the next encounter."
  },
  {
    "id": "reserve_governors_farm_advanced_access",
    "name": "Governor’s Farm Advanced Access",
    "type": "Resource",
    "label": "Resource",
    "description": "Permanently gain +1 ACCURACY on all non-combat skill checks to gather information, write new programs, or hack as long as you take those actions at the Governor’s Farm."
  },
  {
    "id": "reserve_fieldings_workshop_access",
    "name": "Fielding’s Workshop Access",
    "type": "Resource",
    "label": "Resource",
    "description": "Permanently gain +1 ACCURACY and fill in an extra segment whenever you make progress on clocks to invent, create, or repair items or gear as long as you do it at Fielding’s Workshop."
  },
  {
    "id": "reserve_patience_hookup",
    "name": "Patience Hookup",
    "type": "Resource",
    "label": "Resource",
    "description": "You have a direct line to Patience. Spend this reserve to gain +1 ACCURACY on all skill checks and saves for a scene (even in combat) as Patience helps you out."
  }
]
